#Область СлужебныйПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	//((Сафин.Г.З. Доработка по ДЗ. Задание №1 Добавление контактного лица
	
	Имяформы = Форма.Имяформы;
	
	Если Имяформы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли Имяформы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли Имяформы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли Имяформы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаформуПередОснование(Форма);
	ИначеЕсли Имяформы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма);
	КонецЕсли;
	
	//))
	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(форма)
	//((Сафин.Г.З. Доработка по ДЗ. Задание №1 Добавление контактного лица
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("Полеформы"), Форма.Элементы.ГруппаШапкаПраво); 
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода; 
	ПолеВвода.ПутьКДанным = "Объект.net_КонтактноеЛицо";
	//))
КонецПроцедуры 

Процедура ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма)
	//((Сафин.Г.З. Доработка по ДЗ. Задание №1 Добавление контактного лица
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("Полеформы"),, Форма.Элементы.СуммаДокумента); 
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.net_КонтактноеЛицо";
	//))
КонецПроцедуры  

Процедура ВставитьПолеКонтактноеЛицоНаформуПередОснование(Форма)
	//((Сафин.Г.З. Доработка по ДЗ. Задание №1 Добавление контактного лица
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("Полеформы"),, Форма.Элементы.Основание); 
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.net_КонтактноеЛицо"; 
	//))
КонецПроцедуры 

#КонецОбласти